#+title: STL 简明教程

Standard Template Library(STL)中文译为标准模板库。当我们从标准C的语法
进阶到C++，开始接触STL之后，很容易就被这复杂的库弄得晕头转向，无所适从。
那么本文就从较为实用的角度，带大家理解什么是STL，如何使用STL。

注：本文为作者的观点，更严谨的内容请查阅相关文献。

*** vector
vector(中译向量)抽象的是一个序列容器，代表的是可以改变大小的数
组 [fn:3] 。
也就是说，vector可以认为是对数组这种序列结构的一个抽象，并且还包含了大
小可变这个性质。当然，它同时也抽象了对序列的一些操作，如 =push_back=
代表在序列末尾添加一个新的元素。

下面看一个简单的例子：
#+begin_src cpp -n -r :export both :results output
  #include <iostream>
  #include <vector>
  #include <cstdlib> // for rand

  using namespace std;

  int main(int argc, char *argv[])
  {
      srand(time(NULL));
      vector<int> vec;  // (ref:vec-def)
      int i;
      for (i = 0; i < 10; i++) {
          vec.push_back(rand()%1000); // generate a random number (ref:vec-push)
      }

      cout << "vec: ";
      for (i = 0; i < 10; i++) {
          cout << vec[i] << " "; // (ref:vec-access)
      }
      cout << endl;

      int sum = 0;
      for (i = 0; i < 10; i++) {
          sum += vec[i];
      }

      cout << "sum = " << sum << endl;

      return 0;
  }
#+end_src

#+RESULTS:
: vec: 552 928 688 317 784 54 87 827 220 745
: sum = 5202

上面的例子中，第[[(vec-def)]]定义了一个vector，注意上一节中说过，STL是
抽象，所以这里需要指定具体元素的类型，这个例子中就是 =int= 。这里的
=vector<int>= 语法就是C++模板的实例化。

然后是本节开始时提到的，vector同时抽象了对序列的操作，在第
[[(vec-push)]]行中就使用 =push_back= 在序列末尾添加元素。

最后演示的是获取vector中的元素，第[[(vec-access)]]行使用的是类似数组的
访问方式，目的是给大家一个直观的感觉，即vector是对数组的一个抽象。

注意上面的例子很简单，并且只是演示使用，实际使用STL并不推荐诸如
=vec[i]= 这样的用法，在这里不作深入，随着对STL的理解加深，读者自然会明
白用什么方式更合适。

*** 简单的遍历
首先我们需要知道的是STL中的所有容器都包含了iterator对象，通过如下方式
获得iterator的某个类型的实例。这里说得比较绕，是因为正像上节中说的，
iterator需要有 =*tmp= 这样的操作，但是容器元素的类型是多种多样的，所以
也需要有对应的iterator类型，执行如 =*tmp= 操作时才能返回正确类型。

#+begin_src cpp
  vector<int>::iterator vit;
  set<int>::iterator sit;
  vector<int>::const_iterator cvit;
  set<int>::const_iterator csit;
#+end_src

有了iterator之后，就可以通过 =++= 操作和 =*= 操作对容器进行遍历了。
#+begin_src cpp -n :results output :export both
  #include <iostream>
  #include <vector>
  #include <set>

  using namespace std;

  int main(int argc, char *argv[])
  {
      int array[] = {1,1,1,2,3,4,5,6};
      int len = sizeof(array)/sizeof(array[0]);

      vector<int> myvec(array, array+len);
      set<int> myset(array, array+len);

      // get the corresponding iterator
      vector<int>::iterator vit;
      set<int>::iterator sit;

      cout << "The elements of vector are:" << endl;
      for (vit = myvec.begin(); vit != myvec.end(); vit++) {
          cout << *vit << " ";
      }
      cout << endl;

      cout << "The elements of set are:" << endl;
      for (sit = myset.begin(); sit != myset.end(); sit++) {
          cout << *sit << " ";
      }
      cout << endl;

      return 0;
  }
#+end_src

#+RESULTS:
: The elements of vector are:
: 1 1 1 2 3 4 5 6
: The elements of set are:
: 1 2 3 4 5 6

上面的例子本身并没有什么意义，只是演示iterator的使用。在例子中，我们从
容器中得到了它们的iterator: =myvector.begin()=, =myvector.end()=,
=myset.begin()=, 及 =myset.end()= 。容器支持的iterator可以参考
[[http://www.cplusplus.com/reference/stl/][Containers]].

注意，除了iterator，还有另一种迭代器，称为 =const_iterator= ，它们的存
在相当于 =int= 和 =const int= 的区别，用在不允许修改容器内容的情形下。

*** 使用algorithm中的算法
在介绍 iterator 时，我们也同时介绍了 algorithm 的形成，即如果数据结构
能够被很好地抽象，那么它们的共同操作也就可以抽象成算法。那么这节中，我
们就举一些简单的例子，介绍STL中如何使用 algorithm 及 iterator.

这里我们使用
[[http://www.cplusplus.com/reference/algorithm/set_union/][cplusplus.com]]
中的例子，介绍的算法是 =set_union= ，作用是将两个排好序的容器进行集合
的“并”操，我们稍微对例子进行了修改。

首先查看 =set_union= 的API：
#+begin_src cpp
  template <class InputIterator1, class InputIterator2, class OutputIterator>
    OutputIterator set_union (InputIterator1 first1, InputIterator1 last1,
                              InputIterator2 first2, InputIterator2 last2,
                              OutputIterator result);
#+end_src
从中可以看到，我们需要的是两个序列，分别为： =[first1, last1)= 和
=[first2, last)= 。注意由iterator指定的范围中，并不包含 =last1= 指向的
元素。同时需要另一个参数 =result= ，用以标示结果存储的起始位置。返回的
参数指向 =result= 结束的位置。

#+begin_src cpp -n -r :results output :export both
  // set_union example
  #include <iostream>     // std::cout
  #include <algorithm>    // std::set_union, std::sort
  #include <vector>       // std::vector

  int main () {
      int array1[] = {5,10,15,20,25};
      int array2[] = {50,40,30,20,10};
      std::vector<int> first(array1, array1+5);
      std::vector<int> second(array2, array2+5);
      std::vector<int> v(10);                      // 0  0  0  0  0  0  0  0  0  0
      std::vector<int>::iterator it;

      std::sort (first.begin(),first.begin()+5);     //  5 10 15 20 25
      std::sort (second.begin(),second.begin()+5);   // 10 20 30 40 50

      it=std::set_union (first.begin(), first.begin()+5,
                         second.begin(), second.begin()+5,
                         v.begin()); // (ref:union)
      // 5 10 15 20 25 30 40 50  0  0
      v.resize(it-v.begin());        // 5 10 15 20 25 30 40 50 (ref:union-minus)

      std::cout << "The union has " << (v.size()) << " elements:\n";
      for (it=v.begin(); it!=v.end(); ++it)
          std::cout << ' ' << *it;
      std::cout << '\n';

      return 0;
  }
#+end_src

#+RESULTS:
: The union has 8 elements:
:  5 10 15 20 25 30 40 50

这个例子里演示了如何为容器构建iterator，作为algorithm的参数。例子中直
接使用 =first.begin()+5= 这样的方式[[(union)]]，这是有条件的，需要随机访问类型的
iterator，在如 =list= 这样的容器就不能使用，因此，iterator提供了更高层
的一个操作： =advance= 我们在下面会进行介绍。同理，第[[(union-minus)]]
行用以计算两个iterator范围内的元素个数，也有对应的操作： =distance= 。

